{
	"about.hobbies.chess": "Playing chess",
	"about.hobbies.reading": "Reading books and novels",
	"about.hobbies.traveling": "Travelling",
	"about.intro.activities": "Apart from coding, some other activities that I love to do!",
	"about.intro.knowWho": "Know Who",
	"about.intro.me": "I'M",
	"about.intro.motto": "\"Strive to build things that make a difference!\"",
	"about.intro.signature": "Marwan",
	"about.introduction.aprtCode": " Apart from coding, some other activities that I love to do!",
	"about.introduction.back": "as a Back-End Developer",
	"about.introduction.become": "where I learned to work in team, became proficient in ",
	"about.introduction.enhance": "and enhanced my understanding of",
	"about.introduction.form": "from",
	"about.introduction.front": "as a Front-End Developer",
	"about.introduction.full": "Hi Everyone, I am ",
	"about.introduction.internship1": "I completed an internship at ",
	"about.introduction.internship2": "I am currently interning at ",
	"about.introduction.internship3": "I also completed an internship at  Company",
	"about.introduction.location": "Alexandria, Egypt.",
	"about.introduction.name": "Marwan Abubakr",
	"about.labels.skiils.alter": "Professional",
	"about.labels.skiils.primary": "Skillset",
	"about.labels.tools.alter": "I use",
	"about.labels.tools.primary": "Tools",
	"contact.connect": "connect ",
	"contact.feelFree": "Feel free to connect with me",
	"contact.findMeOn": "FIND ME ON",
	"contact.info.fluentIn": "My journey started with a passion for technology, and as I progressed, I realized that programming is not just about writing instructions but is a powerful tool for solving problems and creating innovative solutions.",
	"contact.info.interests": "My area of interest is building",
	"contact.info.loveProgramming": "Hello! I'm Marwan Abubakr. I fell in love with programming and have learned many skills along the way... 🤷‍♂️",
	"contact.info.paragraph.text01": "I am fluent in programming languages such as",
	"contact.info.paragraph.text02": "and focus on building new and innovative web technologies and products. Whenever possible, I apply my passion for product development using",
	"contact.info.paragraph.text03": "and modern JavaScript libraries and frameworks like",
	"contact.info.webTechnologies": "new web technologies and products",
	"contact.info.whatIdo.community": "while enjoying working within teams to develop creative and scalable solutions.",
	"contact.info.whatIdo.improveWeb": "to build integrated web solutions and am always looking for new ways to improve UI design and user experience.",
	"contact.info.whatIdo.now": "What am I doing now? I am working on developing projects using",
	"contact.info.whatIdo.philosophy": "My programming philosophy is to write clean code that follows",
	"contact.introduce": "INTRODUCE",
	"contact.letMe": "LET ME",
	"contact.myself": "MYSELF",
	"contact.reflection": "marwan abubakr",
	"contact.withMe": "with me",
	"footer.copyright": "Copyright  ",
	"footer.developedBy": "Developed by Marwan Abubakr",
	"landing.greeting": "Hi There!",
	"landing.introduction": "I'M",
	"landing.name": "Marwan Abubakr",
	"landing.roles.backEndDotNetCore": "Back End ( ASP.NET Core )",
	"landing.roles.freelancer": "Freelancer",
	"landing.roles.frontEndAngular": "Front End ( Angular +2 )",
	"landing.roles.softwareEngineer": "Software Engineer",
	"landing.wave": "👋🏻",
	"navbar.about": "about",
	"navbar.home": "home",
	"navbar.projects": "projects",
	"navbar.resume": "resume ",
	"projects.commonuse.code": "Githup",
	"projects.commonuse.demo": "demo",
	"projects.commonuse.discription": "discription",
	"projects.commonuse.found": "found",
	"projects.commonuse.project_pro": "Projects ",
	"projects.commonuse.recenlty-project": "Here are a few projects I've worked on recently.",
	"projects.commonuse.title": "Technologies",
	"projects.labels.all": "all",
	"projects.labels.alter": "my recent",
	"projects.labels.frameworks": "frameworks",
	"projects.labels.landing": "landing pages",
	"projects.labels.primary": "work",
	"projects.project_1.description": "Bondi is a sleek and modern website designed to showcase various aspects of a project or personal portfolio. It utilizes a clean layout with minimalist design elements to highlight content effectively. The website is responsive and compatible with different devices, providing a seamless user experience.",
	"projects.project_2.description": "The Avengers website is a fan site dedicated to the Marvel Cinematic Universe's superhero team, the Avengers. It features information about the Avengers, their members, movies, comics, and more. The website is designed to be visually appealing and engaging for fans of the franchise.",
	"projects.project_3.description": "Kasper is a sleek and modern website designed to showcase various aspects of a project or personal portfolio. It utilizes a clean layout with minimalist design elements to highlight content effectively. The website is responsive and compatible with different devices, providing a seamless user experience.",
	"projects.project_4.description": "This CRUD application is developed using React.js for the frontend, Redux Toolkit for state management, and vanilla JavaScript for interactions. The application allows users to perform CRUD operations (Create, Read, Update, Delete) on a set of data. Redux Toolkit simplifies the process of managing application state, making it more predictable and efficient.",
	"projects.project_5.description": "The Hangman game is a classic word-guessing game where players try to guess a hidden word by suggesting letters within a certain number of attempts. This implementation of Hangman provides an interactive and enjoyable gaming experience using web technologies. The game features a user-friendly interface with intuitive controls and dynamic feedback to engage players throughout the gameplay.",
	"projects.project_6.description": "Devfolio is a modern and professional portfolio website template tailored for developers, programmers, and designers to showcase their projects, skills, and achievements. The website features a clean and responsive design, making it easy for visitors to navigate and explore your portfolio on various devices. With Bootstrap's powerful grid system and CSS customization, Devfolio provides a customizable and visually appealing platform for developers to present their work effectively.",
	"projects.project_7.description": "Mealify is a user-friendly website designed to assist users in finding recipes for various meals and cuisines. Whether you're looking for quick weekday dinners, healthy options, or indulgent treats, Mealify has you covered. The website offers a vast collection of recipes, categorized by meal type, dietary preferences, and ingredients. With a clean and intuitive interface, users can easily search, browse, and save their favorite recipes for future reference.",
	"projects.project_8.description": "Fokir is a versatile and stylish website built to showcase personal or business portfolios, projects, or services. It leverages the power of HTML, CSS, and Bootstrap to create a visually appealing and responsive web presence. Whether you're a freelancer, entrepreneur, or creative professional, Fokir provides a customizable platform to present your work or offerings effectively.",
	"projects.project_9.description": "HomeLand is a modern and responsive website designed to showcase real estate properties and services. Leveraging the power of Tailwind CSS for styling and layout, along with React.js and Vite for efficient development, HomeLand provides a seamless and engaging user experience. The website features intuitive navigation, dynamic property listings, and interactive elements to help users find their dream home.",
	"projects.project_10.description": "Our commerce project aims to provide users with an engaging and seamless online shopping experience, inspired by industry leading platforms like Amazon. Built with HTML, CSS, TypeScript, Angular, Bootstrap, Angular NgxPaginationModule, and NotifierModule, the project offers a feature-rich platform for browsing, purchasing, and managing products.",
	"projects.project_11.description": "The FreeToGame Website is a web application that provides a curated list of free-to-play games. It leverages the FreeToGame API to fetch game data and presents it in an organized and user-friendly manner. Users can explore a diverse range of games, filter them based on various criteria, and find details about each game.",
	"projects.project_12.description": "A vibrant, modern website designed to capture the energy of nightlife with bold visuals and dynamic colors. It features an interactive event calendar, fully responsive layout for seamless device compatibility, and easy customization to match any club’s brand\n",
	"projects.project_13.description": "Welcome to Daniels' Portfolio Website! This project showcases the skills and works of Daniels through a personalized portfolio. The website is built using HTML, CSS, Bootstrap, and JavaScript to create a responsive and visually appealing experience.",
	"projects.project_14.description": "Bookmarks is a convenient and user-friendly website designed to help users organize and manage their online bookmarks effectively. With Bookmarks, users can save their favorite websites, articles, or resources, categorize them into folders, and access them easily from any device. The website offers a clean and intuitive interface, making it easy for users to add, edit, and delete bookmarks as needed. Whether you're a student, professional, or casual internet user, Bookmarks provides a simple solution for keeping track of your favorite online content.",
	"projects.project_15.description": "Our CRUD system provides a simple yet effective solution for managing data with basic CRUD operations. Built with HTML5, CSS3, and Bootstrap for styling and layout, and JavaScript for interactivity and functionality, this system allows users to create, read, update, and delete records stored locally using LocalStorage. It offers a user-friendly interface with responsive design, making it accessible across different devices and screen sizes.",
	"projects.project_16.description": "Olivia Wedding is a charming and elegant website designed to celebrate your special day and provide essential information to your guests. With its romantic design and user-friendly interface, Olivia Wedding offers a delightful platform for sharing wedding details, RSVP management, and showcasing your love story. Built with HTML, CSS, JavaScript, and Bootstrap, Olivia Wedding ensures a seamless and memorable experience for both you and your guests.",
	"projects.project_17.description": "Yammy is a web platform dedicated to the world of culinary delights. From an extensive recipe library and meal inspiration to cooking tips and a vibrant community, our project aims to be the go-to resource for anyone passionate about creating and enjoying delicious meals.",
	"projects.project_18.description": "The Weather App is a web application that allows users to check the current weather conditions and forecasts for different locations. It utilizes a weather API to fetch real-time data and provides a user-friendly interface for users to explore weather information.",
	"projects.project_19.description": "Our LocalStorage app is a simple yet powerful tool for storing and managing data locally in the browser. Built with HTML, CSS, and JavaScript, and leveraging the LocalStorage API, our app allows users to store key-value pairs directly in the browser, enabling persistent storage of data even after the browser window is closed. With an intuitive user interface and straightforward functionality, our app provides a convenient solution for managing small-scale data without the need for server-side storage.",
	"projects.project_20.description": "Our GitHub User Information Website provides users with a convenient way to explore GitHub users' profiles, including their repositories, names, followers, and locations. With a clean and intuitive interface, users can easily search for GitHub users and access detailed information about them. Built with HTML, CSS, JavaScript, and the GitHub API, our website offers a seamless experience for discovering and learning more about GitHub users and their contributions.",
	"resume.download": "Download Cv",
	"resume.print": "print"
}
